Tekla Open API Reference for Tekla Structures 2025
OBB Constructor (Point, Vector, Vector, Vector, Double, Double, Double)
 Initializes a new instance of the OBB class.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public OBB(
	Point center,
	Vector axis0,
	Vector axis1,
	Vector axis2,
	double extent0,
	double extent1,
	double extent2
)
Public Sub New (
	center As Point,
	axis0 As Vector,
	axis1 As Vector,
	axis2 As Vector,
	extent0 As Double,
	extent1 As Double,
	extent2 As Double
)
Parameters
center
Type: Tekla.Structures.Geometry3d.Point
Center point of the OBB
axis0
Type: Tekla.Structures.Geometry3d.Vector
Unit-length vector parallel to one axis of the OBB.
axis1
Type: Tekla.Structures.Geometry3d.Vector
Unit-length vector parallel to the second axis of the OBB.
axis2
Type: Tekla.Structures.Geometry3d.Vector
Unit-length vector parallel to the third axis of the OBB.
extent0
Type: System.Double
The extent (half-length) of the side parallel to axis one.
extent1
Type: System.Double
The extent (half-length) of the side parallel to axis two.
extent2
Type: System.Double
The extent (half-length) of the side parallel to axis three.
Exceptions
Exception | Condition
ArgumentException | Thrown when initialization fails.
See Also
Reference
OBB Class
OBB Overload
Tekla.Structures.Geometry3d Namespace